src/ex_Tabakon/InformationRegisters/ТБК_Константы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТБК_Константы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеКонстанты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяКонстанты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/ТБК_Константы/Ext/ManagerModule.bsl
Функция Получить_Магазин() ЭКСПОРТ
	Возврат Получить_ЗначениеКонстанты("Магазин");
КонецФункции

Функция Установить_Магазин(магазин) ЭКСПОРТ
	Установить_ЗначениеКонстанты("Магазин",магазин);
КонецФункции




Функция Получить_РежимРаботыРасширения() ЭКСПОРТ
	Возврат Получить_ЗначениеКонстанты("РежимРаботыРасширения");
КонецФункции

Функция Установить_РежимРаботыРасширения(режимРаботыРасширения) ЭКСПОРТ
	Установить_ЗначениеКонстанты( "РежимРаботыРасширения",режимРаботыРасширения);
	
	док = Новый ТекстовыйДокумент();
	док.УстановитьТекст(режимРаботыРасширения);
	док.Записать("c:\app\database\Tabakon.Configuration.txt", "windows-1251");
	
	фв = Новый файл("c:\app\database\Tabakon.version.loaded.txt");
	Если фв.Существует() Тогда
		УдалитьФайлы("c:\app\database\Tabakon.version.loaded.txt");
	КонецЕсли;
КонецФункции










Функция Установить_ЗначениеКонстанты(имяКонстанты, значениеКонстанты)
	запись = РегистрыСведений.ТБК_Константы.СоздатьМенеджерЗаписи();
	
	запись.ИмяКонстанты = имяКонстанты;
	запись.ЗначениеКонстанты = значениеКонстанты; 
	запись.Записать(Истина);
КонецФункции

Функция Получить_ЗначениеКонстанты(имяКонстанты)
	запись = РегистрыСведений.ТБК_Константы.СоздатьМенеджерЗаписи();
	запись.ИмяКонстанты = имяКонстанты;
	запись.Прочитать();
	
	Если запись.Выбран() Тогда
		Возврат запись.ЗначениеКонстанты;
	КонецЕсли;

КонецФункции
